In [34]:
import numpy as np
import pandas as pd
#numpy.arange 說明書中的中括號[]是可有可無
#range 不可以有浮點數 arange可以有浮點數
print(np.arange(4.0,step=0.2))

#index 索引
#https://numpy.org/devdocs/reference/generated/numpy.array.html
#numpy使用說明書
#pd.Series(np.arange(4.0,step=0.1),index=['a','b','c','d'])
s1 = pd.Series(np.arange(4.0,step=1.0),index=['a','b','c','d'])
s1

[0.  0.2 0.4 0.6 0.8 1.  1.2 1.4 1.6 1.8 2.  2.2 2.4 2.6 2.8 3.  3.2 3.4
 3.6 3.8]

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [22]:
display(s1)
s1[0]

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

/tmp/ipykernel_22370/1551149800.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s1[0]

0.0

In [23]:
s1['a']

0.0

In [25]:
s1[['a','b','d']]

a    0.0
b    1.0
d    3.0
dtype: float64

In [33]:
s1[-2:] *= 2
s1

a      0.0
b      1.0
c    512.0
d    768.0
dtype: float64

In [36]:
#16個 後面4*4要跟前面一樣 也可以8*2
np.reshape(np.arange(16),(4,4))

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [37]:
#dataframe 可以補上欄位跟索引 index欄位名稱  columns列名稱
data = np.arange(16).reshape((4,4))
dataFrame = pd.DataFrame(data,
             index=['台北','台中','台南', '高雄'],
             columns=['one','two','three','four'])
dataFrame

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [38]:
#loc 已列為主
#iloc 是預設的列名稱
dataFrame['one']

台北     0
台中     4
台南     8
高雄    12
Name: one, dtype: int64

In [39]:
dataFrame[['one','two']]

    one  two
台北    0    1
台中    4    5
台南    8    9
高雄   12   13

In [40]:
display(dataFrame)
dataFrame.loc['台北']

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

one      0
two      1
three    2
four     3
Name: 台北, dtype: int64

In [41]:
dataFrame.loc[['台北','台中']]

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7

In [42]:
display(dataFrame)
dataFrame.iloc[0]# iloc 是抓給預設的欄位名稱

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

one      0
two      1
three    2
four     3
Name: 台北, dtype: int64

In [43]:
dataFrame.iloc[[0,1]]

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7

In [44]:
dataFrame.loc[['台北','台中']][['one','two']]

    one  two
台北    0    1
台中    4    5

In [45]:
dataFrame.iloc[[0,1]][['one','two']]

    one  two
台北    0    1
台中    4    5

In [46]:
dataFrame.iloc[[0,1],[0,1]]

    one  two
台北    0    1
台中    4    5